СкладГП/src/InformationRegisters/ДвоичныеДанныеПрисоединенныхФайлов/ДвоичныеДанныеПрисоединенныхФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДвоичныеДанныеПрисоединенныхФайлов</name>
  <resources>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Base64</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>БазаПУ</name>
    <type>
      <types>CatalogRef.БазыПУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID_Ссылки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВладельца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ID_Файла</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/CommonModules/ДвоичныеДанныеПрисоединенныхФайловВызовСервера/Module.bsl
Процедура ЗаписатьДанные(ID_Ссылки, ТипВладельца, Наименование, Описание, Расширение, АдресХранилищаДД) Экспорт
	ДД = ПолучитьИзВременногоХранилища(АдресХранилищаДД);

	Запись = РегистрыСведений.ДвоичныеДанныеПрисоединенныхФайлов.СоздатьМенеджерЗаписи();
	НаборСуществующих = СписокФайловСсылки(ID_Ссылки, ТипВладельца, Наименование);
	Если НаборСуществующих.Количество() > 0 Тогда
		ID_Файла = НаборСуществующих[0].ID_Файла;
	Иначе
		ID_Файла = Новый УникальныйИдентификатор;
	КонецЕсли;
    Запись.БазаПУ		 = ОбщегоНазначенияВызовСервераПовтИсп.БазаПУ();
	Запись.ID_Ссылки	 = ID_Ссылки;
	Запись.ID_Файла		 = ID_Файла;
	Запись.ТипВладельца	 = ТипВладельца;
	Запись.Наименование	 = Наименование;
	Запись.Описание		 = Описание;
	
	Запись.Расширение = Расширение;
	Запись.Base64 = Base64Строка(ДД); 
	
	Запись.Записать(ИСТИНА);
	
КонецПроцедуры

Функция СписокФайловСсылки(ID_Ссылки, ТипВладельца, Наименование)
	НЗ = РегистрыСведений.ДвоичныеДанныеПрисоединенныхФайлов.СоздатьНаборЗаписей();
	НЗ.Отбор.ID_Ссылки.Установить(ID_Ссылки);
	Если ЗначениеЗаполнено(ТипВладельца) Тогда
		НЗ.Отбор.ТипВладельца.Установить(ТипВладельца);
	КонецЕсли;
	Если ЗначениеЗаполнено(Наименование) Тогда
		НЗ.Отбор.Наименование.Установить(Наименование);
	КонецЕсли;
	НЗ.Прочитать();
	Возврат НЗ;
КонецФункции
